# LocationPoint Properties

---
The LocationPoint type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Point| The physical location of the element.
| Rotation| The angle of rotation around the insertion point, in radians.
Top
#### Reference
LocationPoint Class
Autodesk.Revit.DB Namespace